In [15]:
import pandas as pd
import numpy as np

In [4]:
#•	Creating a DataFrame from a list of lists
data=[['sravani',90],['akhila',100],['maheswari',98]]
df=pd.DataFrame(data,columns=['name','marks'])
df

        name  marks
0    sravani     90
1     akhila    100
2  maheswari     98

In [6]:
#•	Creating a DataFrame from a dict of lists:
data={'Name':['sravani','akhila','maheswari'],'Marks':[90,98,100]}
df=pd.DataFrame(data)
df

        Name  Marks
0    sravani     90
1     akhila     98
2  maheswari    100

In [12]:
#•	Creating a DataFrame from a list of dicts
data=[{'Name':'sravani','marks':90},{'Name':'Maheswari','marks':89},{'Name':'Akhila','marks':100}]
df=pd.DataFrame(data,index=[1,2,3])
df

        Name  marks
1    sravani     90
2  Maheswari     89
3     Akhila    100

In [20]:
#•	Creating a DataFrame from a list of dicts and specifying both the row indices and the column indices
data=[{'Name':'sravani','marks':90},{'Name':'Maheswari','marks':89},{'Name':'Akhila','marks':100}]
df=pd.DataFrame(data,index=[1,2,3],columns=['Name','marks'])
df

        Name  marks
1    sravani     90
2  Maheswari     89
3     Akhila    100

In [22]:
#•	Creating a DataFrame from a list of tuples:
data=[(11,12,13),(22,34,56),(78,67,54)]
df=pd.DataFrame(data,columns=['a','b','c'])
df

    a   b   c
0  11  12  13
1  22  34  56
2  78  67  54

In [33]:
#•	Creating a DataFrame using the zip() function:
course=['cse','ece','civil']
fees=[2400,7890,9089]
duration=[5,4,3]
tuples=list(zip(course,fees,duration))
df=pd.DataFrame(tuples,columns=['course','fees','duration'])
df

  course  fees  duration
0    cse  2400         5
1    ece  7890         4
2  civil  9089         3

In [27]:
#•	Creating an empty DataFrame
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [34]:
#How to sort rows within a pandas dataframe
df.sort_values(by=['duration','fees'])

  course  fees  duration
2  civil  9089         3
1    ece  7890         4
0    cse  2400         5

In [ ]:
#How to find the largest value in a pandas dataframe